CSI API ETABS v1
cDesignShearWall.GetSpandrelSummaryResults Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpandrelSummaryResults(
	ref string[] Story,
	ref string[] Spandrel,
	ref string[] Station,
	ref double[] TopRebar,
	ref double[] TopRebarRatio,
	ref string[] TopRebarCombo,
	ref double[] MuTop,
	ref double[] BotRebar,
	ref double[] BotRebarRatio,
	ref string[] BotRebarCombo,
	ref double[] MuBot,
	ref double[] AVert,
	ref double[] AHorz,
	ref string[] ShearCombo,
	ref double[] Vu,
	ref double[] ADiag,
	ref string[] ShearDiagCombo,
	ref double[] VuDiag,
	ref string[] WarnMsg,
	ref string[] ErrMsg
)
Function GetSpandrelSummaryResults (
	ByRef Story As String(),
	ByRef Spandrel As String(),
	ByRef Station As String(),
	ByRef TopRebar As Double(),
	ByRef TopRebarRatio As Double(),
	ByRef TopRebarCombo As String(),
	ByRef MuTop As Double(),
	ByRef BotRebar As Double(),
	ByRef BotRebarRatio As Double(),
	ByRef BotRebarCombo As String(),
	ByRef MuBot As Double(),
	ByRef AVert As Double(),
	ByRef AHorz As Double(),
	ByRef ShearCombo As String(),
	ByRef Vu As Double(),
	ByRef ADiag As Double(),
	ByRef ShearDiagCombo As String(),
	ByRef VuDiag As Double(),
	ByRef WarnMsg As String(),
	ByRef ErrMsg As String()
) As Integer
Dim instance As cDesignShearWall
Dim Story As String()
Dim Spandrel As String()
Dim Station As String()
Dim TopRebar As Double()
Dim TopRebarRatio As Double()
Dim TopRebarCombo As String()
Dim MuTop As Double()
Dim BotRebar As Double()
Dim BotRebarRatio As Double()
Dim BotRebarCombo As String()
Dim MuBot As Double()
Dim AVert As Double()
Dim AHorz As Double()
Dim ShearCombo As String()
Dim Vu As Double()
Dim ADiag As Double()
Dim ShearDiagCombo As String()
Dim VuDiag As Double()
Dim WarnMsg As String()
Dim ErrMsg As String()
Dim returnValue As Integer
returnValue = instance.GetSpandrelSummaryResults(Story,
	Spandrel, Station, TopRebar, TopRebarRatio,
	TopRebarCombo, MuTop, BotRebar, BotRebarRatio,
	BotRebarCombo, MuBot, AVert, AHorz,
	ShearCombo, Vu, ADiag, ShearDiagCombo,
	VuDiag, WarnMsg, ErrMsg)
int GetSpandrelSummaryResults(
	array<String^>^% Story,
	array<String^>^% Spandrel,
	array<String^>^% Station,
	array<double>^% TopRebar,
	array<double>^% TopRebarRatio,
	array<String^>^% TopRebarCombo,
	array<double>^% MuTop,
	array<double>^% BotRebar,
	array<double>^% BotRebarRatio,
	array<String^>^% BotRebarCombo,
	array<double>^% MuBot,
	array<double>^% AVert,
	array<double>^% AHorz,
	array<String^>^% ShearCombo,
	array<double>^% Vu,
	array<double>^% ADiag,
	array<String^>^% ShearDiagCombo,
	array<double>^% VuDiag,
	array<String^>^% WarnMsg,
	array<String^>^% ErrMsg
)
abstract GetSpandrelSummaryResults :
        Story : string[] byref *
        Spandrel : string[] byref *
        Station : string[] byref *
        TopRebar : float[] byref *
        TopRebarRatio : float[] byref *
        TopRebarCombo : string[] byref *
        MuTop : float[] byref *
        BotRebar : float[] byref *
        BotRebarRatio : float[] byref *
        BotRebarCombo : string[] byref *
        MuBot : float[] byref *
        AVert : float[] byref *
        AHorz : float[] byref *
        ShearCombo : string[] byref *
        Vu : float[] byref *
        ADiag : float[] byref *
        ShearDiagCombo : string[] byref *
        VuDiag : float[] byref *
        WarnMsg : string[] byref *
        ErrMsg : string[] byref -> int
Parameters
Story
Type: System.String[]
Spandrel
Type: System.String[]
Station
Type: System.String[]
TopRebar
Type: System.Double[]
TopRebarRatio
Type: System.Double[]
TopRebarCombo
Type: System.String[]
MuTop
Type: System.Double[]
BotRebar
Type: System.Double[]
BotRebarRatio
Type: System.Double[]
BotRebarCombo
Type: System.String[]
MuBot
Type: System.Double[]
AVert
Type: System.Double[]
AHorz
Type: System.Double[]
ShearCombo
Type: System.String[]
Vu
Type: System.Double[]
ADiag
Type: System.Double[]
ShearDiagCombo
Type: System.String[]
VuDiag
Type: System.Double[]
WarnMsg
Type: System.String[]
ErrMsg
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignShearWall Interface
ETABSv1 Namespace